# PathOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..PathOffset Property
ElectricalSystem Class See Also
---
The offset of the horizontal segments of the circuit path.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double PathOffset { get; set; }
```

Visual Basic
---
```text
Public Property PathOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PathOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for pathOffset must be no more than 30000 feet in absolute value. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace